TexasInstruments/mcal_am263px/mcal/Eth/src/hw/Hw_Cpsw_Port.h
/* P0_PRI_CIR_REG */

#define CPSW_CPPI_P0_PRI_CIR_REG_PRI_CIR_MASK            (0x0FFFFFFFU)
#define CPSW_CPPI_P0_PRI_CIR_REG_PRI_CIR_SHIFT           (0x00000000U)
#define CPSW_CPPI_P0_PRI_CIR_REG_PRI_CIR_MAX             (0x0FFFFFFFU)

/* P0_PRI_EIR_REG */

#define CPSW_CPPI_P0_PRI_EIR_REG_PRI_EIR_MASK            (0x0FFFFFFFU)
#define CPSW_CPPI_P0_PRI_EIR_REG_PRI_EIR_SHIFT           (0x00000000U)
#define CPSW_CPPI_P0_PRI_EIR_REG_PRI_EIR_MAX             (0x0FFFFFFFU)

/* P0_TX_D_THRESH_SET_L_REG */

#define CPSW_CPPI_P0_TX_D_THRESH_SET_L_REG_PRI0_MASK     (0x0000001FU)
#define CPSW_CPPI_P0_TX_D_THRESH_SET_L_REG_PRI0_SHIFT    (0x00000000U)
#define CPSW_CPPI_P0_TX_D_THRESH_SET_L_REG_PRI0_MAX      (0x0000001FU)

#define CPSW_CPPI_P0_TX_D_THRESH_SET_L_REG_PRI1_MASK     (0x00001F00U)
#define CPSW_CPPI_P0_TX_D_THRESH_SET_L_REG_PRI1_SHIFT    (0x00000008U)
#define CPSW_CPPI_P0_TX_D_THRESH_SET_L_REG_PRI1_MAX      (0x0000001FU)

#define CPSW_CPPI_P0_TX_D_THRESH_SET_L_REG_PRI2_MASK     (0x001F0000U)
#define CPSW_CPPI_P0_TX_D_THRESH_SET_L_REG_PRI2_SHIFT    (0x00000010U)
#define CPSW_CPPI_P0_TX_D_THRESH_SET_L_REG_PRI2_MAX      (0x0000001FU)

#define CPSW_CPPI_P0_TX_D_THRESH_SET_L_REG_PRI3_MASK     (0x1F000000U)
#define CPSW_CPPI_P0_TX_D_THRESH_SET_L_REG_PRI3_SHIFT    (0x00000018U)
#define CPSW_CPPI_P0_TX_D_THRESH_SET_L_REG_PRI3_MAX      (0x0000001FU)

/* P0_TX_D_THRESH_SET_H_REG */

#define CPSW_CPPI_P0_TX_D_THRESH_SET_H_REG_PRI4_MASK     (0x0000001FU)
#define CPSW_CPPI_P0_TX_D_THRESH_SET_H_REG_PRI4_SHIFT    (0x00000000U)
#define CPSW_CPPI_P0_TX_D_THRESH_SET_H_REG_PRI4_MAX      (0x0000001FU)

#define CPSW_CPPI_P0_TX_D_THRESH_SET_H_REG_PRI5_MASK     (0x00001F00U)
#define CPSW_CPPI_P0_TX_D_THRESH_SET_H_REG_PRI5_SHIFT    (0x00000008U)
#define CPSW_CPPI_P0_TX_D_THRESH_SET_H_REG_PRI5_MAX      (0x0000001FU)

#define CPSW_CPPI_P0_TX_D_THRESH_SET_H_REG_PRI6_MASK     (0x001F0000U)
#define CPSW_CPPI_P0_TX_D_THRESH_SET_H_REG_PRI6_SHIFT    (0x00000010U)
#define CPSW_CPPI_P0_TX_D_THRESH_SET_H_REG_PRI6_MAX      (0x0000001FU)

#define CPSW_CPPI_P0_TX_D_THRESH_SET_H_REG_PRI7_MASK     (0x1F000000U)
#define CPSW_CPPI_P0_TX_D_THRESH_SET_H_REG_PRI7_SHIFT    (0x00000018U)
#define CPSW_CPPI_P0_TX_D_THRESH_SET_H_REG_PRI7_MAX      (0x0000001FU)

/* P0_TX_D_THRESH_CLR_L_REG */

#define CPSW_CPPI_P0_TX_D_THRESH_CLR_L_REG_PRI0_MASK     (0x0000001FU)
#define CPSW_CPPI_P0_TX_D_THRESH_CLR_L_REG_PRI0_SHIFT    (0x00000000U)
#define CPSW_CPPI_P0_TX_D_THRESH_CLR_L_REG_PRI0_MAX      (0x0000001FU)

#define CPSW_CPPI_P0_TX_D_THRESH_CLR_L_REG_PRI1_MASK     (0x00001F00U)
#define CPSW_CPPI_P0_TX_D_THRESH_CLR_L_REG_PRI1_SHIFT    (0x00000008U)
#define CPSW_CPPI_P0_TX_D_THRESH_CLR_L_REG_PRI1_MAX      (0x0000001FU)

#define CPSW_CPPI_P0_TX_D_THRESH_CLR_L_REG_PRI2_MASK     (0x001F0000U)
#define CPSW_CPPI_P0_TX_D_THRESH_CLR_L_REG_PRI2_SHIFT    (0x00000010U)
#define CPSW_CPPI_P0_TX_D_THRESH_CLR_L_REG_PRI2_MAX      (0x0000001FU)

#define CPSW_CPPI_P0_TX_D_THRESH_CLR_L_REG_PRI3_MASK     (0x1F000000U)
#define CPSW_CPPI_P0_TX_D_THRESH_CLR_L_REG_PRI3_SHIFT    (0x00000018U)
#define CPSW_CPPI_P0_TX_D_THRESH_CLR_L_REG_PRI3_MAX      (0x0000001FU)

/* P0_TX_D_THRESH_CLR_H_REG */

#define CPSW_CPPI_P0_TX_D_THRESH_CLR_H_REG_PRI4_MASK     (0x0000001FU)
#define CPSW_CPPI_P0_TX_D_THRESH_CLR_H_REG_PRI4_SHIFT    (0x00000000U)
#define CPSW_CPPI_P0_TX_D_THRESH_CLR_H_REG_PRI4_MAX      (0x0000001FU)

#define CPSW_CPPI_P0_TX_D_THRESH_CLR_H_REG_PRI5_MASK     (0x00001F00U)
#define CPSW_CPPI_P0_TX_D_THRESH_CLR_H_REG_PRI5_SHIFT    (0x00000008U)
#define CPSW_CPPI_P0_TX_D_THRESH_CLR_H_REG_PRI5_MAX      (0x0000001FU)

#define CPSW_CPPI_P0_TX_D_THRESH_CLR_H_REG_PRI6_MASK     (0x001F0000U)
#define CPSW_CPPI_P0_TX_D_THRESH_CLR_H_REG_PRI6_SHIFT    (0x00000010U)
#define CPSW_CPPI_P0_TX_D_THRESH_CLR_H_REG_PRI6_MAX      (0x0000001FU)

#define CPSW_CPPI_P0_TX_D_THRESH_CLR_H_REG_PRI7_MASK     (0x1F000000U)
#define CPSW_CPPI_P0_TX_D_THRESH_CLR_H_REG_PRI7_SHIFT    (0x00000018U)
#define CPSW_CPPI_P0_TX_D_THRESH_CLR_H_REG_PRI7_MAX      (0x0000001FU)

/* P0_TX_G_BUF_THRESH_SET_L_REG */

#define CPSW_CPPI_P0_TX_G_BUF_THRESH_SET_L_REG_PRI0_MASK  (0x0000001FU)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_SET_L_REG_PRI0_SHIFT (0x00000000U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_SET_L_REG_PRI0_MAX   (0x0000001FU)

#define CPSW_CPPI_P0_TX_G_BUF_THRESH_SET_L_REG_PRI1_MASK  (0x00001F00U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_SET_L_REG_PRI1_SHIFT (0x00000008U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_SET_L_REG_PRI1_MAX   (0x0000001FU)

#define CPSW_CPPI_P0_TX_G_BUF_THRESH_SET_L_REG_PRI2_MASK  (0x001F0000U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_SET_L_REG_PRI2_SHIFT (0x00000010U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_SET_L_REG_PRI2_MAX   (0x0000001FU)

#define CPSW_CPPI_P0_TX_G_BUF_THRESH_SET_L_REG_PRI3_MASK  (0x1F000000U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_SET_L_REG_PRI3_SHIFT (0x00000018U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_SET_L_REG_PRI3_MAX   (0x0000001FU)

/* P0_TX_G_BUF_THRESH_SET_H_REG */

#define CPSW_CPPI_P0_TX_G_BUF_THRESH_SET_H_REG_PRI4_MASK  (0x0000001FU)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_SET_H_REG_PRI4_SHIFT (0x00000000U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_SET_H_REG_PRI4_MAX   (0x0000001FU)

#define CPSW_CPPI_P0_TX_G_BUF_THRESH_SET_H_REG_PRI5_MASK  (0x00001F00U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_SET_H_REG_PRI5_SHIFT (0x00000008U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_SET_H_REG_PRI5_MAX   (0x0000001FU)

#define CPSW_CPPI_P0_TX_G_BUF_THRESH_SET_H_REG_PRI6_MASK  (0x001F0000U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_SET_H_REG_PRI6_SHIFT (0x00000010U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_SET_H_REG_PRI6_MAX   (0x0000001FU)

#define CPSW_CPPI_P0_TX_G_BUF_THRESH_SET_H_REG_PRI7_MASK  (0x1F000000U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_SET_H_REG_PRI7_SHIFT (0x00000018U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_SET_H_REG_PRI7_MAX   (0x0000001FU)

/* P0_TX_G_BUF_THRESH_CLR_L_REG */

#define CPSW_CPPI_P0_TX_G_BUF_THRESH_CLR_L_REG_PRI0_MASK  (0x0000001FU)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_CLR_L_REG_PRI0_SHIFT (0x00000000U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_CLR_L_REG_PRI0_MAX   (0x0000001FU)

#define CPSW_CPPI_P0_TX_G_BUF_THRESH_CLR_L_REG_PRI1_MASK  (0x00001F00U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_CLR_L_REG_PRI1_SHIFT (0x00000008U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_CLR_L_REG_PRI1_MAX   (0x0000001FU)

