TexasInstruments/mcal_am263px/mcal/Eth/src/hw/Hw_Cpsw_Port.h
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_CLR_L_REG_PRI2_MASK  (0x001F0000U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_CLR_L_REG_PRI2_SHIFT (0x00000010U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_CLR_L_REG_PRI2_MAX   (0x0000001FU)

#define CPSW_CPPI_P0_TX_G_BUF_THRESH_CLR_L_REG_PRI3_MASK  (0x1F000000U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_CLR_L_REG_PRI3_SHIFT (0x00000018U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_CLR_L_REG_PRI3_MAX   (0x0000001FU)

/* P0_TX_G_BUF_THRESH_CLR_H_REG */

#define CPSW_CPPI_P0_TX_G_BUF_THRESH_CLR_H_REG_PRI4_MASK  (0x0000001FU)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_CLR_H_REG_PRI4_SHIFT (0x00000000U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_CLR_H_REG_PRI4_MAX   (0x0000001FU)

#define CPSW_CPPI_P0_TX_G_BUF_THRESH_CLR_H_REG_PRI5_MASK  (0x00001F00U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_CLR_H_REG_PRI5_SHIFT (0x00000008U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_CLR_H_REG_PRI5_MAX   (0x0000001FU)

#define CPSW_CPPI_P0_TX_G_BUF_THRESH_CLR_H_REG_PRI6_MASK  (0x001F0000U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_CLR_H_REG_PRI6_SHIFT (0x00000010U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_CLR_H_REG_PRI6_MAX   (0x0000001FU)

#define CPSW_CPPI_P0_TX_G_BUF_THRESH_CLR_H_REG_PRI7_MASK  (0x1F000000U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_CLR_H_REG_PRI7_SHIFT (0x00000018U)
#define CPSW_CPPI_P0_TX_G_BUF_THRESH_CLR_H_REG_PRI7_MAX   (0x0000001FU)

/* P0_SRC_ID_A_REG */

#define CPSW_CPPI_P0_SRC_ID_A_REG_PORT1_MASK             (0x000000FFU)
#define CPSW_CPPI_P0_SRC_ID_A_REG_PORT1_SHIFT            (0x00000000U)
#define CPSW_CPPI_P0_SRC_ID_A_REG_PORT1_MAX              (0x000000FFU)

#define CPSW_CPPI_P0_SRC_ID_A_REG_PORT2_MASK             (0x0000FF00U)
#define CPSW_CPPI_P0_SRC_ID_A_REG_PORT2_SHIFT            (0x00000008U)
#define CPSW_CPPI_P0_SRC_ID_A_REG_PORT2_MAX              (0x000000FFU)

#define CPSW_CPPI_P0_SRC_ID_A_REG_PORT3_MASK             (0x00FF0000U)
#define CPSW_CPPI_P0_SRC_ID_A_REG_PORT3_SHIFT            (0x00000010U)
#define CPSW_CPPI_P0_SRC_ID_A_REG_PORT3_MAX              (0x000000FFU)

#define CPSW_CPPI_P0_SRC_ID_A_REG_PORT4_MASK             (0xFF000000U)
#define CPSW_CPPI_P0_SRC_ID_A_REG_PORT4_SHIFT            (0x00000018U)
#define CPSW_CPPI_P0_SRC_ID_A_REG_PORT4_MAX              (0x000000FFU)

/* P0_SRC_ID_B_REG */

#define CPSW_CPPI_P0_SRC_ID_B_REG_PORT5_MASK             (0x000000FFU)
#define CPSW_CPPI_P0_SRC_ID_B_REG_PORT5_SHIFT            (0x00000000U)
#define CPSW_CPPI_P0_SRC_ID_B_REG_PORT5_MAX              (0x000000FFU)

#define CPSW_CPPI_P0_SRC_ID_B_REG_PORT6_MASK             (0x0000FF00U)
#define CPSW_CPPI_P0_SRC_ID_B_REG_PORT6_SHIFT            (0x00000008U)
#define CPSW_CPPI_P0_SRC_ID_B_REG_PORT6_MAX              (0x000000FFU)

#define CPSW_CPPI_P0_SRC_ID_B_REG_PORT7_MASK             (0x00FF0000U)
#define CPSW_CPPI_P0_SRC_ID_B_REG_PORT7_SHIFT            (0x00000010U)
#define CPSW_CPPI_P0_SRC_ID_B_REG_PORT7_MAX              (0x000000FFU)

#define CPSW_CPPI_P0_SRC_ID_B_REG_PORT8_MASK             (0xFF000000U)
#define CPSW_CPPI_P0_SRC_ID_B_REG_PORT8_SHIFT            (0x00000018U)
#define CPSW_CPPI_P0_SRC_ID_B_REG_PORT8_MAX              (0x000000FFU)

/* P0_HOST_BLKS_PRI_REG */

#define CPSW_CPPI_P0_HOST_BLKS_PRI_REG_PRI0_MASK         (0x0000000FU)
#define CPSW_CPPI_P0_HOST_BLKS_PRI_REG_PRI0_SHIFT        (0x00000000U)
#define CPSW_CPPI_P0_HOST_BLKS_PRI_REG_PRI0_MAX          (0x0000000FU)

#define CPSW_CPPI_P0_HOST_BLKS_PRI_REG_PRI1_MASK         (0x000000F0U)
#define CPSW_CPPI_P0_HOST_BLKS_PRI_REG_PRI1_SHIFT        (0x00000004U)
#define CPSW_CPPI_P0_HOST_BLKS_PRI_REG_PRI1_MAX          (0x0000000FU)

#define CPSW_CPPI_P0_HOST_BLKS_PRI_REG_PRI2_MASK         (0x00000F00U)
#define CPSW_CPPI_P0_HOST_BLKS_PRI_REG_PRI2_SHIFT        (0x00000008U)
#define CPSW_CPPI_P0_HOST_BLKS_PRI_REG_PRI2_MAX          (0x0000000FU)

#define CPSW_CPPI_P0_HOST_BLKS_PRI_REG_PRI3_MASK         (0x0000F000U)
#define CPSW_CPPI_P0_HOST_BLKS_PRI_REG_PRI3_SHIFT        (0x0000000CU)
#define CPSW_CPPI_P0_HOST_BLKS_PRI_REG_PRI3_MAX          (0x0000000FU)

#define CPSW_CPPI_P0_HOST_BLKS_PRI_REG_PRI4_MASK         (0x000F0000U)
#define CPSW_CPPI_P0_HOST_BLKS_PRI_REG_PRI4_SHIFT        (0x00000010U)
#define CPSW_CPPI_P0_HOST_BLKS_PRI_REG_PRI4_MAX          (0x0000000FU)

#define CPSW_CPPI_P0_HOST_BLKS_PRI_REG_PRI5_MASK         (0x00F00000U)
#define CPSW_CPPI_P0_HOST_BLKS_PRI_REG_PRI5_SHIFT        (0x00000014U)
#define CPSW_CPPI_P0_HOST_BLKS_PRI_REG_PRI5_MAX          (0x0000000FU)

#define CPSW_CPPI_P0_HOST_BLKS_PRI_REG_PRI6_MASK         (0x0F000000U)
#define CPSW_CPPI_P0_HOST_BLKS_PRI_REG_PRI6_SHIFT        (0x00000018U)
#define CPSW_CPPI_P0_HOST_BLKS_PRI_REG_PRI6_MAX          (0x0000000FU)

#define CPSW_CPPI_P0_HOST_BLKS_PRI_REG_PRI7_MASK         (0xF0000000U)
#define CPSW_CPPI_P0_HOST_BLKS_PRI_REG_PRI7_SHIFT        (0x0000001CU)
#define CPSW_CPPI_P0_HOST_BLKS_PRI_REG_PRI7_MAX          (0x0000000FU)

/* PN_RESERVED_REG */

#define CPSW_ETH_PN_RESERVED_REG_RESERVED_MASK           (0xFFFFFFFFU)
#define CPSW_ETH_PN_RESERVED_REG_RESERVED_SHIFT          (0x00000000U)
#define CPSW_ETH_PN_RESERVED_REG_RESERVED_MAX            (0xFFFFFFFFU)

/* PN_CONTROL_REG */

#define CPSW_ETH_PN_CONTROL_REG_DSCP_IPV4_EN_MASK        (0x00000002U)
#define CPSW_ETH_PN_CONTROL_REG_DSCP_IPV4_EN_SHIFT       (0x00000001U)
#define CPSW_ETH_PN_CONTROL_REG_DSCP_IPV4_EN_MAX         (0x00000001U)

#define CPSW_ETH_PN_CONTROL_REG_DSCP_IPV6_EN_MASK        (0x00000004U)
#define CPSW_ETH_PN_CONTROL_REG_DSCP_IPV6_EN_SHIFT       (0x00000002U)
#define CPSW_ETH_PN_CONTROL_REG_DSCP_IPV6_EN_MAX         (0x00000001U)

#define CPSW_ETH_PN_CONTROL_REG_TX_LPI_CLKSTOP_EN_MASK   (0x00001000U)
#define CPSW_ETH_PN_CONTROL_REG_TX_LPI_CLKSTOP_EN_SHIFT  (0x0000000CU)
#define CPSW_ETH_PN_CONTROL_REG_TX_LPI_CLKSTOP_EN_MAX    (0x00000001U)

#define CPSW_ETH_PN_CONTROL_REG_TX_ECC_ERR_EN_MASK       (0x00004000U)
#define CPSW_ETH_PN_CONTROL_REG_TX_ECC_ERR_EN_SHIFT      (0x0000000EU)
#define CPSW_ETH_PN_CONTROL_REG_TX_ECC_ERR_EN_MAX        (0x00000001U)

#define CPSW_ETH_PN_CONTROL_REG_RX_ECC_ERR_EN_MASK       (0x00008000U)
#define CPSW_ETH_PN_CONTROL_REG_RX_ECC_ERR_EN_SHIFT      (0x0000000FU)
#define CPSW_ETH_PN_CONTROL_REG_RX_ECC_ERR_EN_MAX        (0x00000001U)

#define CPSW_ETH_PN_CONTROL_REG_IET_PORT_EN_MASK         (0x00010000U)
#define CPSW_ETH_PN_CONTROL_REG_IET_PORT_EN_SHIFT        (0x00000010U)
#define CPSW_ETH_PN_CONTROL_REG_IET_PORT_EN_MAX          (0x00000001U)

#define CPSW_ETH_PN_CONTROL_REG_EST_PORT_EN_MASK         (0x00020000U)
#define CPSW_ETH_PN_CONTROL_REG_EST_PORT_EN_SHIFT        (0x00000011U)
#define CPSW_ETH_PN_CONTROL_REG_EST_PORT_EN_MAX          (0x00000001U)

/* PN_MAX_BLKS_REG */

#define CPSW_ETH_PN_MAX_BLKS_REG_RX_MAX_BLKS_MASK        (0x000000FFU)
#define CPSW_ETH_PN_MAX_BLKS_REG_RX_MAX_BLKS_SHIFT       (0x00000000U)
#define CPSW_ETH_PN_MAX_BLKS_REG_RX_MAX_BLKS_MAX         (0x000000FFU)

#define CPSW_ETH_PN_MAX_BLKS_REG_TX_MAX_BLKS_MASK        (0x0000FF00U)
#define CPSW_ETH_PN_MAX_BLKS_REG_TX_MAX_BLKS_SHIFT       (0x00000008U)
#define CPSW_ETH_PN_MAX_BLKS_REG_TX_MAX_BLKS_MAX         (0x000000FFU)

