TexasInstruments/mcal_am263px/mcal/Eth/src/hw/Hw_Cpsw_Port.h
#define CPSW_ETH_PN_TX_BLKS_PRI_REG_PRI3_MASK            (0x0000F000U)
#define CPSW_ETH_PN_TX_BLKS_PRI_REG_PRI3_SHIFT           (0x0000000CU)
#define CPSW_ETH_PN_TX_BLKS_PRI_REG_PRI3_MAX             (0x0000000FU)

#define CPSW_ETH_PN_TX_BLKS_PRI_REG_PRI4_MASK            (0x000F0000U)
#define CPSW_ETH_PN_TX_BLKS_PRI_REG_PRI4_SHIFT           (0x00000010U)
#define CPSW_ETH_PN_TX_BLKS_PRI_REG_PRI4_MAX             (0x0000000FU)

#define CPSW_ETH_PN_TX_BLKS_PRI_REG_PRI5_MASK            (0x00F00000U)
#define CPSW_ETH_PN_TX_BLKS_PRI_REG_PRI5_SHIFT           (0x00000014U)
#define CPSW_ETH_PN_TX_BLKS_PRI_REG_PRI5_MAX             (0x0000000FU)

#define CPSW_ETH_PN_TX_BLKS_PRI_REG_PRI6_MASK            (0x0F000000U)
#define CPSW_ETH_PN_TX_BLKS_PRI_REG_PRI6_SHIFT           (0x00000018U)
#define CPSW_ETH_PN_TX_BLKS_PRI_REG_PRI6_MAX             (0x0000000FU)

#define CPSW_ETH_PN_TX_BLKS_PRI_REG_PRI7_MASK            (0xF0000000U)
#define CPSW_ETH_PN_TX_BLKS_PRI_REG_PRI7_SHIFT           (0x0000001CU)
#define CPSW_ETH_PN_TX_BLKS_PRI_REG_PRI7_MAX             (0x0000000FU)

/* PN_RX_FLOW_THRESH_REG */

#define CPSW_ETH_PN_RX_FLOW_THRESH_REG_COUNT_MASK        (0x000001FFU)
#define CPSW_ETH_PN_RX_FLOW_THRESH_REG_COUNT_SHIFT       (0x00000000U)
#define CPSW_ETH_PN_RX_FLOW_THRESH_REG_COUNT_MAX         (0x000001FFU)

/* PN_IDLE2LPI_REG */

#define CPSW_ETH_PN_IDLE2LPI_REG_COUNT_MASK              (0x00FFFFFFU)
#define CPSW_ETH_PN_IDLE2LPI_REG_COUNT_SHIFT             (0x00000000U)
#define CPSW_ETH_PN_IDLE2LPI_REG_COUNT_MAX               (0x00FFFFFFU)

/* PN_LPI2WAKE_REG */

#define CPSW_ETH_PN_LPI2WAKE_REG_COUNT_MASK              (0x00FFFFFFU)
#define CPSW_ETH_PN_LPI2WAKE_REG_COUNT_SHIFT             (0x00000000U)
#define CPSW_ETH_PN_LPI2WAKE_REG_COUNT_MAX               (0x00FFFFFFU)

/* PN_EEE_STATUS_REG */

#define CPSW_ETH_PN_EEE_STATUS_REG_WAIT_IDLE2LPI_MASK    (0x00000001U)
#define CPSW_ETH_PN_EEE_STATUS_REG_WAIT_IDLE2LPI_SHIFT   (0x00000000U)
#define CPSW_ETH_PN_EEE_STATUS_REG_WAIT_IDLE2LPI_MAX     (0x00000001U)

#define CPSW_ETH_PN_EEE_STATUS_REG_RX_LPI_MASK           (0x00000002U)
#define CPSW_ETH_PN_EEE_STATUS_REG_RX_LPI_SHIFT          (0x00000001U)
#define CPSW_ETH_PN_EEE_STATUS_REG_RX_LPI_MAX            (0x00000001U)

#define CPSW_ETH_PN_EEE_STATUS_REG_TX_LPI_MASK           (0x00000004U)
#define CPSW_ETH_PN_EEE_STATUS_REG_TX_LPI_SHIFT          (0x00000002U)
#define CPSW_ETH_PN_EEE_STATUS_REG_TX_LPI_MAX            (0x00000001U)

#define CPSW_ETH_PN_EEE_STATUS_REG_TX_WAKE_MASK          (0x00000008U)
#define CPSW_ETH_PN_EEE_STATUS_REG_TX_WAKE_SHIFT         (0x00000003U)
#define CPSW_ETH_PN_EEE_STATUS_REG_TX_WAKE_MAX           (0x00000001U)

#define CPSW_ETH_PN_EEE_STATUS_REG_TX_FIFO_HOLD_MASK     (0x00000010U)
#define CPSW_ETH_PN_EEE_STATUS_REG_TX_FIFO_HOLD_SHIFT    (0x00000004U)
#define CPSW_ETH_PN_EEE_STATUS_REG_TX_FIFO_HOLD_MAX      (0x00000001U)

#define CPSW_ETH_PN_EEE_STATUS_REG_RX_FIFO_EMPTY_MASK    (0x00000020U)
#define CPSW_ETH_PN_EEE_STATUS_REG_RX_FIFO_EMPTY_SHIFT   (0x00000005U)
#define CPSW_ETH_PN_EEE_STATUS_REG_RX_FIFO_EMPTY_MAX     (0x00000001U)

#define CPSW_ETH_PN_EEE_STATUS_REG_TX_FIFO_EMPTY_MASK    (0x00000040U)
#define CPSW_ETH_PN_EEE_STATUS_REG_TX_FIFO_EMPTY_SHIFT   (0x00000006U)
#define CPSW_ETH_PN_EEE_STATUS_REG_TX_FIFO_EMPTY_MAX     (0x00000001U)

/* PN_FIFO_STATUS_REG */

#define CPSW_ETH_PN_FIFO_STATUS_REG_TX_PRI_ACTIVE_MASK   (0x000000FFU)
#define CPSW_ETH_PN_FIFO_STATUS_REG_TX_PRI_ACTIVE_SHIFT  (0x00000000U)
#define CPSW_ETH_PN_FIFO_STATUS_REG_TX_PRI_ACTIVE_MAX    (0x000000FFU)

#define CPSW_ETH_PN_FIFO_STATUS_REG_TX_E_MAC_ALLOW_MASK  (0x0000FF00U)
#define CPSW_ETH_PN_FIFO_STATUS_REG_TX_E_MAC_ALLOW_SHIFT (0x00000008U)
#define CPSW_ETH_PN_FIFO_STATUS_REG_TX_E_MAC_ALLOW_MAX   (0x000000FFU)

#define CPSW_ETH_PN_FIFO_STATUS_REG_EST_CNT_ERR_MASK     (0x00010000U)
#define CPSW_ETH_PN_FIFO_STATUS_REG_EST_CNT_ERR_SHIFT    (0x00000010U)
#define CPSW_ETH_PN_FIFO_STATUS_REG_EST_CNT_ERR_MAX      (0x00000001U)

#define CPSW_ETH_PN_FIFO_STATUS_REG_EST_ADD_ERR_MASK     (0x00020000U)
#define CPSW_ETH_PN_FIFO_STATUS_REG_EST_ADD_ERR_SHIFT    (0x00000011U)
#define CPSW_ETH_PN_FIFO_STATUS_REG_EST_ADD_ERR_MAX      (0x00000001U)

#define CPSW_ETH_PN_FIFO_STATUS_REG_EST_BUFACT_MASK      (0x00040000U)
#define CPSW_ETH_PN_FIFO_STATUS_REG_EST_BUFACT_SHIFT     (0x00000012U)
#define CPSW_ETH_PN_FIFO_STATUS_REG_EST_BUFACT_MAX       (0x00000001U)

/* PN_EST_CONTROL_REG */

#define CPSW_ETH_PN_EST_CONTROL_REG_EST_ONEBUF_MASK      (0x00000001U)
#define CPSW_ETH_PN_EST_CONTROL_REG_EST_ONEBUF_SHIFT     (0x00000000U)
#define CPSW_ETH_PN_EST_CONTROL_REG_EST_ONEBUF_MAX       (0x00000001U)

#define CPSW_ETH_PN_EST_CONTROL_REG_EST_BUFSEL_MASK      (0x00000002U)
#define CPSW_ETH_PN_EST_CONTROL_REG_EST_BUFSEL_SHIFT     (0x00000001U)
#define CPSW_ETH_PN_EST_CONTROL_REG_EST_BUFSEL_MAX       (0x00000001U)

#define CPSW_ETH_PN_EST_CONTROL_REG_EST_TS_EN_MASK       (0x00000004U)
#define CPSW_ETH_PN_EST_CONTROL_REG_EST_TS_EN_SHIFT      (0x00000002U)
#define CPSW_ETH_PN_EST_CONTROL_REG_EST_TS_EN_MAX        (0x00000001U)

#define CPSW_ETH_PN_EST_CONTROL_REG_EST_TS_FIRST_MASK    (0x00000008U)
#define CPSW_ETH_PN_EST_CONTROL_REG_EST_TS_FIRST_SHIFT   (0x00000003U)
#define CPSW_ETH_PN_EST_CONTROL_REG_EST_TS_FIRST_MAX     (0x00000001U)

#define CPSW_ETH_PN_EST_CONTROL_REG_EST_TS_ONEPRI_MASK   (0x00000010U)
#define CPSW_ETH_PN_EST_CONTROL_REG_EST_TS_ONEPRI_SHIFT  (0x00000004U)
#define CPSW_ETH_PN_EST_CONTROL_REG_EST_TS_ONEPRI_MAX    (0x00000001U)

#define CPSW_ETH_PN_EST_CONTROL_REG_EST_TS_PRI_MASK      (0x000000E0U)
#define CPSW_ETH_PN_EST_CONTROL_REG_EST_TS_PRI_SHIFT     (0x00000005U)
#define CPSW_ETH_PN_EST_CONTROL_REG_EST_TS_PRI_MAX       (0x00000007U)

#define CPSW_ETH_PN_EST_CONTROL_REG_EST_FILL_EN_MASK     (0x00000100U)
#define CPSW_ETH_PN_EST_CONTROL_REG_EST_FILL_EN_SHIFT    (0x00000008U)
#define CPSW_ETH_PN_EST_CONTROL_REG_EST_FILL_EN_MAX      (0x00000001U)

#define CPSW_ETH_PN_EST_CONTROL_REG_EST_FILL_MARGIN_MASK (0x03FF0000U)
#define CPSW_ETH_PN_EST_CONTROL_REG_EST_FILL_MARGIN_SHIFT (0x00000010U)
#define CPSW_ETH_PN_EST_CONTROL_REG_EST_FILL_MARGIN_MAX  (0x000003FFU)

/* PN_RX_DSCP_MAP_REG */

#define CPSW_ETH_PN_RX_DSCP_MAP_REG_PRI0_MASK            (0x00000007U)
#define CPSW_ETH_PN_RX_DSCP_MAP_REG_PRI0_SHIFT           (0x00000000U)
#define CPSW_ETH_PN_RX_DSCP_MAP_REG_PRI0_MAX             (0x00000007U)

#define CPSW_ETH_PN_RX_DSCP_MAP_REG_PRI1_MASK            (0x00000070U)
#define CPSW_ETH_PN_RX_DSCP_MAP_REG_PRI1_SHIFT           (0x00000004U)
#define CPSW_ETH_PN_RX_DSCP_MAP_REG_PRI1_MAX             (0x00000007U)

#define CPSW_ETH_PN_RX_DSCP_MAP_REG_PRI2_MASK            (0x00000700U)
#define CPSW_ETH_PN_RX_DSCP_MAP_REG_PRI2_SHIFT           (0x00000008U)
#define CPSW_ETH_PN_RX_DSCP_MAP_REG_PRI2_MAX             (0x00000007U)

