TexasInstruments/mcal_am263px/mcal/Eth/src/hw/Hw_Cpsw_Port.h
#define CPSW_ETH_PN_TS_CTL_REG_TS_LTYPE2_EN_MASK         (0x00000100U)
#define CPSW_ETH_PN_TS_CTL_REG_TS_LTYPE2_EN_SHIFT        (0x00000008U)
#define CPSW_ETH_PN_TS_CTL_REG_TS_LTYPE2_EN_MAX          (0x00000001U)

#define CPSW_ETH_PN_TS_CTL_REG_TS_RX_ANNEX_E_EN_MASK     (0x00000200U)
#define CPSW_ETH_PN_TS_CTL_REG_TS_RX_ANNEX_E_EN_SHIFT    (0x00000009U)
#define CPSW_ETH_PN_TS_CTL_REG_TS_RX_ANNEX_E_EN_MAX      (0x00000001U)

#define CPSW_ETH_PN_TS_CTL_REG_TS_TX_ANNEX_E_EN_MASK     (0x00000400U)
#define CPSW_ETH_PN_TS_CTL_REG_TS_TX_ANNEX_E_EN_SHIFT    (0x0000000AU)
#define CPSW_ETH_PN_TS_CTL_REG_TS_TX_ANNEX_E_EN_MAX      (0x00000001U)

#define CPSW_ETH_PN_TS_CTL_REG_TS_TX_HOST_TS_EN_MASK     (0x00000800U)
#define CPSW_ETH_PN_TS_CTL_REG_TS_TX_HOST_TS_EN_SHIFT    (0x0000000BU)
#define CPSW_ETH_PN_TS_CTL_REG_TS_TX_HOST_TS_EN_MAX      (0x00000001U)

#define CPSW_ETH_PN_TS_CTL_REG_TS_MSG_TYPE_EN_MASK       (0xFFFF0000U)
#define CPSW_ETH_PN_TS_CTL_REG_TS_MSG_TYPE_EN_SHIFT      (0x00000010U)
#define CPSW_ETH_PN_TS_CTL_REG_TS_MSG_TYPE_EN_MAX        (0x0000FFFFU)

/* PN_TS_SEQ_LTYPE_REG */

#define CPSW_ETH_PN_TS_SEQ_LTYPE_REG_TS_LTYPE1_MASK      (0x0000FFFFU)
#define CPSW_ETH_PN_TS_SEQ_LTYPE_REG_TS_LTYPE1_SHIFT     (0x00000000U)
#define CPSW_ETH_PN_TS_SEQ_LTYPE_REG_TS_LTYPE1_MAX       (0x0000FFFFU)

#define CPSW_ETH_PN_TS_SEQ_LTYPE_REG_TS_SEQ_ID_OFFSET_MASK (0x003F0000U)
#define CPSW_ETH_PN_TS_SEQ_LTYPE_REG_TS_SEQ_ID_OFFSET_SHIFT (0x00000010U)
#define CPSW_ETH_PN_TS_SEQ_LTYPE_REG_TS_SEQ_ID_OFFSET_MAX (0x0000003FU)

/* PN_TS_VLAN_LTYPE_REG */

#define CPSW_ETH_PN_TS_VLAN_LTYPE_REG_TS_VLAN_LTYPE1_MASK (0x0000FFFFU)
#define CPSW_ETH_PN_TS_VLAN_LTYPE_REG_TS_VLAN_LTYPE1_SHIFT (0x00000000U)
#define CPSW_ETH_PN_TS_VLAN_LTYPE_REG_TS_VLAN_LTYPE1_MAX (0x0000FFFFU)

#define CPSW_ETH_PN_TS_VLAN_LTYPE_REG_TS_VLAN_LTYPE2_MASK (0xFFFF0000U)
#define CPSW_ETH_PN_TS_VLAN_LTYPE_REG_TS_VLAN_LTYPE2_SHIFT (0x00000010U)
#define CPSW_ETH_PN_TS_VLAN_LTYPE_REG_TS_VLAN_LTYPE2_MAX (0x0000FFFFU)

/* PN_TS_CTL_LTYPE2_REG */

#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_LTYPE2_MASK     (0x0000FFFFU)
#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_LTYPE2_SHIFT    (0x00000000U)
#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_LTYPE2_MAX      (0x0000FFFFU)

#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_107_MASK        (0x00010000U)
#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_107_SHIFT       (0x00000010U)
#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_107_MAX         (0x00000001U)

#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_129_MASK        (0x00020000U)
#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_129_SHIFT       (0x00000011U)
#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_129_MAX         (0x00000001U)

#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_130_MASK        (0x00040000U)
#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_130_SHIFT       (0x00000012U)
#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_130_MAX         (0x00000001U)

#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_131_MASK        (0x00080000U)
#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_131_SHIFT       (0x00000013U)
#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_131_MAX         (0x00000001U)

#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_132_MASK        (0x00100000U)
#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_132_SHIFT       (0x00000014U)
#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_132_MAX         (0x00000001U)

#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_319_MASK        (0x00200000U)
#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_319_SHIFT       (0x00000015U)
#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_319_MAX         (0x00000001U)

#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_320_MASK        (0x00400000U)
#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_320_SHIFT       (0x00000016U)
#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_320_MAX         (0x00000001U)

#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_TTL_NONZERO_MASK (0x00800000U)
#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_TTL_NONZERO_SHIFT (0x00000017U)
#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_TTL_NONZERO_MAX (0x00000001U)

#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_UNI_EN_MASK     (0x01000000U)
#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_UNI_EN_SHIFT    (0x00000018U)
#define CPSW_ETH_PN_TS_CTL_LTYPE2_REG_TS_UNI_EN_MAX      (0x00000001U)

/* PN_TS_CTL2_REG */

#define CPSW_ETH_PN_TS_CTL2_REG_TS_MCAST_TYPE_EN_MASK    (0x0000FFFFU)
#define CPSW_ETH_PN_TS_CTL2_REG_TS_MCAST_TYPE_EN_SHIFT   (0x00000000U)
#define CPSW_ETH_PN_TS_CTL2_REG_TS_MCAST_TYPE_EN_MAX     (0x0000FFFFU)

#define CPSW_ETH_PN_TS_CTL2_REG_TS_DOMAIN_OFFSET_MASK    (0x003F0000U)
#define CPSW_ETH_PN_TS_CTL2_REG_TS_DOMAIN_OFFSET_SHIFT   (0x00000010U)
#define CPSW_ETH_PN_TS_CTL2_REG_TS_DOMAIN_OFFSET_MAX     (0x0000003FU)

/* PN_MAC_CONTROL_REG */

#define CPSW_ETH_PN_MAC_CONTROL_REG_FULLDUPLEX_MASK      (0x00000001U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_FULLDUPLEX_SHIFT     (0x00000000U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_FULLDUPLEX_MAX       (0x00000001U)

#define CPSW_ETH_PN_MAC_CONTROL_REG_LOOPBACK_MASK        (0x00000002U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_LOOPBACK_SHIFT       (0x00000001U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_LOOPBACK_MAX         (0x00000001U)

#define CPSW_ETH_PN_MAC_CONTROL_REG_MTEST_MASK           (0x00000004U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_MTEST_SHIFT          (0x00000002U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_MTEST_MAX            (0x00000001U)

#define CPSW_ETH_PN_MAC_CONTROL_REG_RX_FLOW_EN_MASK      (0x00000008U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_RX_FLOW_EN_SHIFT     (0x00000003U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_RX_FLOW_EN_MAX       (0x00000001U)

#define CPSW_ETH_PN_MAC_CONTROL_REG_TX_FLOW_EN_MASK      (0x00000010U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_TX_FLOW_EN_SHIFT     (0x00000004U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_TX_FLOW_EN_MAX       (0x00000001U)

#define CPSW_ETH_PN_MAC_CONTROL_REG_GMII_EN_MASK         (0x00000020U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_GMII_EN_SHIFT        (0x00000005U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_GMII_EN_MAX          (0x00000001U)

#define CPSW_ETH_PN_MAC_CONTROL_REG_TX_PACE_MASK         (0x00000040U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_TX_PACE_SHIFT        (0x00000006U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_TX_PACE_MAX          (0x00000001U)

#define CPSW_ETH_PN_MAC_CONTROL_REG_GIG_MASK             (0x00000080U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_GIG_SHIFT            (0x00000007U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_GIG_MAX              (0x00000001U)

#define CPSW_ETH_PN_MAC_CONTROL_REG_TX_SHORT_GAP_ENABLE_MASK (0x00000400U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_TX_SHORT_GAP_ENABLE_SHIFT (0x0000000AU)
#define CPSW_ETH_PN_MAC_CONTROL_REG_TX_SHORT_GAP_ENABLE_MAX (0x00000001U)

#define CPSW_ETH_PN_MAC_CONTROL_REG_CMD_IDLE_MASK        (0x00000800U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_CMD_IDLE_SHIFT       (0x0000000BU)
#define CPSW_ETH_PN_MAC_CONTROL_REG_CMD_IDLE_MAX         (0x00000001U)

#define CPSW_ETH_PN_MAC_CONTROL_REG_CRC_TYPE_MASK        (0x00001000U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_CRC_TYPE_SHIFT       (0x0000000CU)
#define CPSW_ETH_PN_MAC_CONTROL_REG_CRC_TYPE_MAX         (0x00000001U)

#define CPSW_ETH_PN_MAC_CONTROL_REG_IFCTL_A_MASK         (0x00008000U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_IFCTL_A_SHIFT        (0x0000000FU)
#define CPSW_ETH_PN_MAC_CONTROL_REG_IFCTL_A_MAX          (0x00000001U)

