TexasInstruments/mcal_am263px/mcal/Eth/src/hw/Hw_Cpsw_Port.h
#define CPSW_ETH_PN_MAC_CONTROL_REG_IFCTL_B_MASK         (0x00010000U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_IFCTL_B_SHIFT        (0x00000010U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_IFCTL_B_MAX          (0x00000001U)

#define CPSW_ETH_PN_MAC_CONTROL_REG_GIG_FORCE_MASK       (0x00020000U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_GIG_FORCE_SHIFT      (0x00000011U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_GIG_FORCE_MAX        (0x00000001U)

#define CPSW_ETH_PN_MAC_CONTROL_REG_CTL_EN_MASK          (0x00040000U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_CTL_EN_SHIFT         (0x00000012U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_CTL_EN_MAX           (0x00000001U)

#define CPSW_ETH_PN_MAC_CONTROL_REG_EXT_RX_FLOW_EN_MASK  (0x00080000U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_EXT_RX_FLOW_EN_SHIFT (0x00000013U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_EXT_RX_FLOW_EN_MAX   (0x00000001U)

#define CPSW_ETH_PN_MAC_CONTROL_REG_EXT_TX_FLOW_EN_MASK  (0x00100000U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_EXT_TX_FLOW_EN_SHIFT (0x00000014U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_EXT_TX_FLOW_EN_MAX   (0x00000001U)

#define CPSW_ETH_PN_MAC_CONTROL_REG_TX_SHORT_GAP_LIM_EN_MASK (0x00200000U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_TX_SHORT_GAP_LIM_EN_SHIFT (0x00000015U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_TX_SHORT_GAP_LIM_EN_MAX (0x00000001U)

#define CPSW_ETH_PN_MAC_CONTROL_REG_RX_CEF_EN_MASK       (0x00400000U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_RX_CEF_EN_SHIFT      (0x00000016U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_RX_CEF_EN_MAX        (0x00000001U)

#define CPSW_ETH_PN_MAC_CONTROL_REG_RX_CSF_EN_MASK       (0x00800000U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_RX_CSF_EN_SHIFT      (0x00000017U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_RX_CSF_EN_MAX        (0x00000001U)

#define CPSW_ETH_PN_MAC_CONTROL_REG_RX_CMF_EN_MASK       (0x01000000U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_RX_CMF_EN_SHIFT      (0x00000018U)
#define CPSW_ETH_PN_MAC_CONTROL_REG_RX_CMF_EN_MAX        (0x00000001U)

/* PN_MAC_STATUS_REG */

#define CPSW_ETH_PN_MAC_STATUS_REG_TX_FLOW_ACT_MASK      (0x00000001U)
#define CPSW_ETH_PN_MAC_STATUS_REG_TX_FLOW_ACT_SHIFT     (0x00000000U)
#define CPSW_ETH_PN_MAC_STATUS_REG_TX_FLOW_ACT_MAX       (0x00000001U)

#define CPSW_ETH_PN_MAC_STATUS_REG_RX_FLOW_ACT_MASK      (0x00000002U)
#define CPSW_ETH_PN_MAC_STATUS_REG_RX_FLOW_ACT_SHIFT     (0x00000001U)
#define CPSW_ETH_PN_MAC_STATUS_REG_RX_FLOW_ACT_MAX       (0x00000001U)

#define CPSW_ETH_PN_MAC_STATUS_REG_EXT_FULLDUPLEX_MASK   (0x00000008U)
#define CPSW_ETH_PN_MAC_STATUS_REG_EXT_FULLDUPLEX_SHIFT  (0x00000003U)
#define CPSW_ETH_PN_MAC_STATUS_REG_EXT_FULLDUPLEX_MAX    (0x00000001U)

#define CPSW_ETH_PN_MAC_STATUS_REG_EXT_GIG_MASK          (0x00000010U)
#define CPSW_ETH_PN_MAC_STATUS_REG_EXT_GIG_SHIFT         (0x00000004U)
#define CPSW_ETH_PN_MAC_STATUS_REG_EXT_GIG_MAX           (0x00000001U)

#define CPSW_ETH_PN_MAC_STATUS_REG_EXT_TX_FLOW_EN_MASK   (0x00000020U)
#define CPSW_ETH_PN_MAC_STATUS_REG_EXT_TX_FLOW_EN_SHIFT  (0x00000005U)
#define CPSW_ETH_PN_MAC_STATUS_REG_EXT_TX_FLOW_EN_MAX    (0x00000001U)

#define CPSW_ETH_PN_MAC_STATUS_REG_EXT_RX_FLOW_EN_MASK   (0x00000040U)
#define CPSW_ETH_PN_MAC_STATUS_REG_EXT_RX_FLOW_EN_SHIFT  (0x00000006U)
#define CPSW_ETH_PN_MAC_STATUS_REG_EXT_RX_FLOW_EN_MAX    (0x00000001U)

#define CPSW_ETH_PN_MAC_STATUS_REG_RX_PFC_FLOW_ACT_MASK  (0x0000FF00U)
#define CPSW_ETH_PN_MAC_STATUS_REG_RX_PFC_FLOW_ACT_SHIFT (0x00000008U)
#define CPSW_ETH_PN_MAC_STATUS_REG_RX_PFC_FLOW_ACT_MAX   (0x000000FFU)

#define CPSW_ETH_PN_MAC_STATUS_REG_TX_PFC_FLOW_ACT_MASK  (0x00FF0000U)
#define CPSW_ETH_PN_MAC_STATUS_REG_TX_PFC_FLOW_ACT_SHIFT (0x00000010U)
#define CPSW_ETH_PN_MAC_STATUS_REG_TX_PFC_FLOW_ACT_MAX   (0x000000FFU)

#define CPSW_ETH_PN_MAC_STATUS_REG_TORF_PRI_MASK         (0x07000000U)
#define CPSW_ETH_PN_MAC_STATUS_REG_TORF_PRI_SHIFT        (0x00000018U)
#define CPSW_ETH_PN_MAC_STATUS_REG_TORF_PRI_MAX          (0x00000007U)

#define CPSW_ETH_PN_MAC_STATUS_REG_TORF_MASK             (0x08000000U)
#define CPSW_ETH_PN_MAC_STATUS_REG_TORF_SHIFT            (0x0000001BU)
#define CPSW_ETH_PN_MAC_STATUS_REG_TORF_MAX              (0x00000001U)

#define CPSW_ETH_PN_MAC_STATUS_REG_TX_IDLE_MASK          (0x10000000U)
#define CPSW_ETH_PN_MAC_STATUS_REG_TX_IDLE_SHIFT         (0x0000001CU)
#define CPSW_ETH_PN_MAC_STATUS_REG_TX_IDLE_MAX           (0x00000001U)

#define CPSW_ETH_PN_MAC_STATUS_REG_P_IDLE_MASK           (0x20000000U)
#define CPSW_ETH_PN_MAC_STATUS_REG_P_IDLE_SHIFT          (0x0000001DU)
#define CPSW_ETH_PN_MAC_STATUS_REG_P_IDLE_MAX            (0x00000001U)

#define CPSW_ETH_PN_MAC_STATUS_REG_E_IDLE_MASK           (0x40000000U)
#define CPSW_ETH_PN_MAC_STATUS_REG_E_IDLE_SHIFT          (0x0000001EU)
#define CPSW_ETH_PN_MAC_STATUS_REG_E_IDLE_MAX            (0x00000001U)

#define CPSW_ETH_PN_MAC_STATUS_REG_IDLE_MASK             (0x80000000U)
#define CPSW_ETH_PN_MAC_STATUS_REG_IDLE_SHIFT            (0x0000001FU)
#define CPSW_ETH_PN_MAC_STATUS_REG_IDLE_MAX              (0x00000001U)

/* PN_MAC_SOFT_RESET_REG */

#define CPSW_ETH_PN_MAC_SOFT_RESET_REG_SOFT_RESET_MASK   (0x00000001U)
#define CPSW_ETH_PN_MAC_SOFT_RESET_REG_SOFT_RESET_SHIFT  (0x00000000U)
#define CPSW_ETH_PN_MAC_SOFT_RESET_REG_SOFT_RESET_MAX    (0x00000001U)


/* PN_MAC_SOFT_RESET_REG */

#define CPSW_CPDMA_SOFT_RESET_REG_SOFT_RESET_MASK   (0x00000001U)
#define CPSW_CPDMA_SOFT_RESET_REG_SOFT_RESET_SHIFT  (0x00000000U)
#define CPSW_CPDMA_SOFT_RESET_REG_SOFT_RESET_MAX    (0x00000001U)

/* PN_MAC_BOFFTEST_REG */

#define CPSW_ETH_PN_MAC_BOFFTEST_REG_TX_BACKOFF_MASK     (0x000003FFU)
#define CPSW_ETH_PN_MAC_BOFFTEST_REG_TX_BACKOFF_SHIFT    (0x00000000U)
#define CPSW_ETH_PN_MAC_BOFFTEST_REG_TX_BACKOFF_MAX      (0x000003FFU)

#define CPSW_ETH_PN_MAC_BOFFTEST_REG_COLL_COUNT_MASK     (0x0000F000U)
#define CPSW_ETH_PN_MAC_BOFFTEST_REG_COLL_COUNT_SHIFT    (0x0000000CU)
#define CPSW_ETH_PN_MAC_BOFFTEST_REG_COLL_COUNT_MAX      (0x0000000FU)

#define CPSW_ETH_PN_MAC_BOFFTEST_REG_RNDNUM_MASK         (0x03FF0000U)
#define CPSW_ETH_PN_MAC_BOFFTEST_REG_RNDNUM_SHIFT        (0x00000010U)
#define CPSW_ETH_PN_MAC_BOFFTEST_REG_RNDNUM_MAX          (0x000003FFU)

